import 'package:flutter/material.dart';

Widget servicesText = Column(
  mainAxisAlignment: MainAxisAlignment.start,
  crossAxisAlignment: CrossAxisAlignment.start,
  children: [
    Container(
        margin: EdgeInsets.only(left: 20, right: 20, top: 40, bottom: 10),
        child: Image.asset('lib/images/our_team.jfif')),

    Container(
      padding: EdgeInsets.symmetric(horizontal: 20) ,
      child: RichText(
        textAlign: TextAlign.justify,
        text: TextSpan(
          style: new TextStyle(
            fontSize: 16,
            color: Colors.black,
          ),
          children: [
            new TextSpan(
              text: 'Е',
              style: new TextStyle(
                  fontWeight: FontWeight.bold,
                  fontSize: 40,
                  color: Colors.deepPurple),
            ),
            new TextSpan(
                text: 'кспресс-доставка вантажів\n',
                style: new TextStyle(color: Colors.deepPurple, fontSize: 20)),
            new TextSpan(
              text: 'Компанія «Автолюкс Експрес пошта» пропонує послуги з перевезення вантажів. Не кожна компанія здійснює перевезення негабаритних вантажів. Але компанія «Автолюкс Експрес пошта» завжди готова прийти на допомогу своїм клієнтам. Ще зовсім недавно її діяльність обмежувалася територією України, але сьогодні компанія «Автолюкс Експрес пошта» вийшла і на міжнародний рівень. Завдяки широкій мережі регіональних представництв, у клієнтів є можливість обрати пункт з найбільш зручним для них розташуванням, щоб відправити або отримати вантаж.\n\n'
            ),
            new TextSpan(
              text: 'П',
              style: new TextStyle(
                  fontWeight: FontWeight.bold,
                  fontSize: 40,
                  color: Colors.deepPurple),
            ),
            new TextSpan(
                text: 'ринцип роботи сервісу доставки вантажу:\n',
                style: new TextStyle(color: Colors.deepPurple, fontSize: 20)),
            new TextSpan(
              text: 'Якщо Вас цікавить перевезення негабаритних вантажів (тобто таких, які вимагають спеціальної упаковки і транспортного засобу) або звичайна доставка вантажів по Україні, Вам потрібно звернутися в офіс нашої компанії і заповнити відповідні документи. Зокрема, потрібно оформити товарно-транспортну накладну, яка супроводжує доставку вантажу. Вартість послуг визначається перевізником відповідно до затверджених тарифів. Порядок розрахунку Ви можете подивитися на нашому сайті. Якщо клієнт згоден з такою вартістю, то вантаж повністю оформляється для перевезення. Після того, як все буде оформлено, відправнику треба буде повідомити одержувачу реквізити товарно-транспортної накладної - її номер, дату, орієнтовний термін доставки. Всі ці відомості клієнт отримує від оператора.\n\n'
            ),
            new TextSpan(
              text: 'Після того, як все буде оформлено, вантаж відправляється в дорогу. Наша компанія розробляє найзручніші маршрути для доставки вантажів. Наприклад, ми здійснюємо попутні перевезення, при яких доставка відбувається за допомогою транспорту, який так чи інакше їде до пункту призначення. Це дозволяє включити в географію вантажоперевезень додаткові райони та населені пункти.\n\n'
            ),
            new TextSpan(
              text: 'Одержувач після повідомлення про надходження вантажу в зазначений офіс, приходить туди з паспортом (а для юридичних осіб потрібна належно оформлена довіреність або так званий довірчий лист, обов\'язково з мокрою печаткою).\n\n'
            ),
            new TextSpan(
              text: 'Д',
              style: new TextStyle(
                  fontWeight: FontWeight.bold,
                  fontSize: 40,
                  color: Colors.deepPurple),
            ),
            new TextSpan(
                text: 'одаткові послуги\n',
                style: new TextStyle(color: Colors.deepPurple, fontSize: 20)),
            new TextSpan(
              text: 'Експрес-доставка вантажів - це найважливіший напрямок діяльності компанії. З кожним роком географія цього сервісу стає все більш широкою. Компанія «Автолюкс Експрес пошта» надає своїм клієнтам і різні додаткові послуги, пов\'язані з основною діяльністю. Зокрема, це упаковка вантажів, повідомлення одержувача про прибуття вантажу за допомогою СМС, а також переадресування (тобто зміна пункту прибуття або одержувача вантажу). Вартість таких послуг визначається окремо, згідно з тарифами на ці послуги.\n\n'
            ),
            new TextSpan(
              text: 'Доставка товарів, документів в найкоротші терміни і на найбільш вигідних умовах, індивідуальний підхід до кожного нашого клієнта, гнучка тарифна політика - ось ті причини, з яких щодня сотні клієнтів обирають співпрацю з нашою компанією.\n\n'
            ),
            new TextSpan(
              text: 'Компанія «Автолюкс Експрес пошта» постійно вдосконалює свою роботу.  Кількість офісів компанії «Автолюкс Експрес пошта» збільшується з кожним роком.\n\n'
            ),
            new TextSpan(
              text: 'Будемо раді Вас бачити нашим клієнтом!\n\n'
            )
          ],
        ),
      ),
    ),
  ],
);